tap "argoproj/tap"
tap "equalsraf/neovim-qt"
tap "felixkratz/formulae"
tap "goreleaser/tap"
tap "hamed-elfayome/claude-usage"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "maciejwalkowiak/brew"
tap "manaflow-ai/cmux"
tap "nikitabobko/tap"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "sst/tap"
tap "testingisdocumenting/brew"
tap "tldev/tap"
tap "weaveworks/tap"
tap "wimdeblauwe/ttcli"
brew "openssl@3"
brew "argocd"
brew "xz"
brew "asitop"
brew "aspell"
brew "ast-grep"
brew "gettext"
brew "autoconf"
brew "autojump"
brew "automake"
brew "cairo"
brew "harfbuzz"
brew "libtiff"
brew "jpeg-xl"
brew "aws-google-auth"
brew "awscli"
brew "backlog-md"
brew "bash"
brew "bat"
brew "openjdk"
brew "bfg"
brew "binutils"
brew "bottom"
brew "brightness"
brew "broot"
brew "caddy"
brew "ccache"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "certbot"
brew "cheat"
brew "clusterctl"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "commitizen"
brew "coreutils"
brew "ctags"
brew "curl"
brew "d2"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "doxx"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "figlet"
brew "findutils"
brew "libtool"
brew "fzf"
brew "gawk"
brew "gdu"
brew "gemini-cli"
brew "gh"
brew "libarchive"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-machete"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go@1.19"
brew "go@1.20"
brew "goreleaser", link: false
brew "goreman"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "h2"
brew "helm"
brew "helm-docs"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hurl"
brew "icdiff"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "ipcalc"
brew "jdtls"
brew "jira-cli"
brew "openjdk@21"
brew "python@3.12"
brew "jmeter"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "kdoctor"
brew "keychain"
brew "kind"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "leveldb"
brew "libfido2"
brew "lima"
brew "llvm"
brew "lld"
brew "llm"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "macvim"
brew "markdown-oxide"
brew "maven"
brew "mdbook"
brew "mercurial"
brew "minikube"
brew "mole"
brew "mysql"
brew "mysql-client"
brew "nasm"
brew "navi"
brew "neovim"
brew "neovim-qt"
brew "netcat"
brew "ninja"
brew "node_exporter", restart_service: :changed
brew "ripgrep"
brew "opencode"
brew "openjdk@17"
brew "operator-sdk"
brew "pandoc"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "prometheus"
brew "putty"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-setuptools"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep-all"
brew "rust"
brew "rustup"
brew "saml2aws"
brew "scipy"
brew "socat"
brew "socket_vmnet"
brew "sqlc"
brew "sshpass"
brew "stow"
brew "syncthing", restart_service: :changed
brew "terminal-notifier"
brew "tfenv"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tokyo-cabinet"
brew "trash"
brew "tree"
brew "ttyd"
brew "unar"
brew "up"
brew "uv"
brew "vhs"
brew "vivid"
brew "watch"
brew "wget"
brew "xclip"
brew "yaml-language-server"
brew "yarn"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/packer"
brew "koekeishiya/formulae/skhd"
brew "oven-sh/bun/bun"
brew "weaveworks/tap/eksctl"
cask "nikitabobko/tap/aerospace"
cask "cmux"
cask "docker-desktop"
cask "dorso"
cask "flutter"
cask "font-d2coding-nerd-font"
cask "font-fira-code"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-sarasa-gothic"
cask "gcloud-cli"
cask "ghostty"
cask "goreleaser/tap/goreleaser"
cask "headlamp"
cask "iterm2"
cask "karabiner-elements"
cask "nodebox"
cask "ollama-app"
cask "whisky"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "anysphere.remote-wsl"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.arb-editor"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "highagency.pencildev"
vscode "htmlhint.vscode-htmlhint"
vscode "hverlin.mise-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kirozen.wordcounter"
vscode "kombai.kombai"
vscode "lunuan.kubernetes-templates"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "tobermory.es6-string-html"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
go "golang.org/x/tools/gopls"
